content-org/notes.org
#+author: rayes
#+hugo_base_dir: ~/sites/personal-site/
#+hugo_section: notes
#+hugo_front_matter_format: yaml
#+hugo_level_offset: 0
#+startup: fold content customtime logdone
#+options: tex:dvisvgm
# #+macro: tex @@html:{{<tex "$1">}}@@
#+macro: tex $$1$
#+macro: dtex $$$1$$
#+macro: note @@html:{{<note "$1">}}@@

* DONE Modern Asian Pop Music Observations                     :@Music:anime:
CLOSED: [2022-03-17 Thu 14:40]
:PROPERTIES:
:EXPORT_FILE_NAME: anime-pop
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :status inprogress
:END:
Some aggregated observations of common harmonic tendencies and chord progressions that give the modernistic Asian pop sound found in a lot of contemporary music from the East Asia region, in particular focusing on anime and film music. Some good examples of this type of sound include the music of film composers like Hayao Miyazaki, Joe Hisaishi, and Ryuichi Sakamoto, almost every anime opening or ending, some J-pop and C-pop artists, in particular mandopop artists like Jay Chou, Mayday, JJ Lin, contemporary Asian instrumental music (Yiruma in particular), and Western artists that also use this sound (Porter Robinson, even contemporary or neoclassical artists like Ludovico Einaudi and Maurice Ravel in certain sections of their music).

{{{note(These are based on my observations only. I am not a musical historian nor a music expert\, and I only play music as a side hobby.)}}}

** Western Pop Origins
Since East Asian pop is descended from Western pop music, it makes sense to first take a look into the influential progressions that shaped Western pop. Namely, the following types of chord changes and their variants:

- Main harmonic progression :: Some mix of I, vi, IV, and V, notable examples include:
  - [[https://en.wikipedia.org/wiki/I%E2%80%93V%E2%80%93vi%E2%80%93IV_progression][I-V-vi-IV]]
  - [[https://en.wikipedia.org/wiki/%2750s_progression][I-vi-IV-V]]
- Main cadences/resolutions/"special" chords :: The classic resolutions that are most common are obviously IV-V-I and ii-V-I. Other fairly common ones include:
  - The V-vi deceptive cadence. When combined with the subdominant, it becomes IV-V-vi (or what appears to be more common, the descending version vi-V-IV), and vi-V-IV
    - An interesting, recessed alternative from classical music is what I like to call the "plagal deceptive cadence" (IV-vi). From what I see, it typically pops up in the middle of progressions, but it can be used as a cadence.
  - [[https://en.wikipedia.org/wiki/Mixolydian_mode][Mixolydian progressions]], basically progressions containing some form of a ♭VII. From my understanding, this came from jazz and the concept of [[https://en.wikipedia.org/wiki/Borrowed_chord][borrowed chords]]. The use of a occasional ♭VII with the main I, vi, IV, and V chords gives a distinctly "modern pop" sound and is very common. See [[https://en.wikipedia.org/wiki/%E2%99%ADVII%E2%80%93V7_cadence][♭VII–V7]] and [[https://en.wikipedia.org/wiki/Backdoor_progression][backdoor progressions]] for examples.
  - Progessions around the circle of fifths/fourths (I-IV-vii^{o}-iii-vi-ii-V-I), or [[https://en.wikipedia.org/wiki/Pachelbel%27s_Canon][similar variants]]. Commonly used in the middle of progressions for smooth modulations between keys.

** Asian Pop Chords. Why IV-V-iii-vi works
It seems a trend for Asian style pop to either start on a subdominant chord (IV), or to have it at least on a strong beat. In my view, the reason the IV is an acceptable starting chord and why it's used over other chords is because IV contains the major tonic note, as well as tonic note of the relative minor, hinting at both of these. Because the first chord usually establishes the general feel and reference point for the rest of the chords, it makes sense to choose IV over chords like V for this purpose.
** IV-V-vi and a few (of many) variants
The IV-V-vi is a very common chord progression in not just pop music, and is just a deceptive cadence (V-vi) with a subdominant IV to set it up. The reason it works, especially for pop, is that it's easy to voice lead the bass (it's just whole tones), which is a large part of what makes or breaks a progression. Here are a few of the more popular variants:

- [[https://en.wikipedia.org/wiki/IV%E2%96%B37%E2%80%93V7%E2%80%93iii7%E2%80%93vi_progression][IV-V-iii-vi]]. The "royal road progression". AKA the progression that's used in pretty much every anime opening. This is pretty much the same thing as a IV-V-vi, but since 4/4 music is often in four bar phrases, having four chords means we don't need to repeat one of chords. iii is the same thing as a V/vi (without a raised leading tone) and resolves nicely to the vi.
  - IV-V-III^{#3}-vi. You may have deduced that if iii is the same as V/vi (the dominant chord of the relative minor), we can raise the seventh making it a III^{#3}. This creates a more atonalic sound because we have more or less migrated to the minor key. The III^{#3} is often used in transitions between section changes, and is so common that I might even venture to call it a norm in this genre.
- IV-V-vi-I.
- IV-V-I-vi.
- IV-I-V-vi. Same progression as the famous [[https://en.wikipedia.org/wiki/I%E2%80%93V%E2%80%93vi%E2%80%93IV%5Fprogression][I-V-vi-IV]] that we mentioned above for Western music, only rotated so that the starting chord is on the IV.
- vi-V-IV-(I). Instead of IV-V-vi, we can reverse it and start on the relative minor.
# Examples: intro of 'Homura' by LiSA.

** Use of iii
In the IV-V-iii-vi progression, the iii assumes the role of V/vi. The iii chord can also be used to lead into the IV, being only one semitone away, which (similarly as before) works because of the voice leading in the bass. Some chord changes in pop music break the rules of functional harmony, however, it will sound fine as long as the voice leading in the bass and melody is smooth.

Some examples of progressions with iii leading to IV:
- IV-V-vi-iii
- I-iii-IV-V
# Examples: Hitorigoto

** COMMENT Modulation
